Revit 2027 API
UIApplication.ApplicationClosing Event
 Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<ApplicationClosingEventArgs> ApplicationClosing
Public Event ApplicationClosing As EventHandler(Of ApplicationClosingEventArgs)
public:
 event EventHandler<ApplicationClosingEventArgs^>^ ApplicationClosing {
	void add (EventHandler<ApplicationClosingEventArgs^>^ value);
	void remove (EventHandler<ApplicationClosingEventArgs^>^ value);
}
member ApplicationClosing : IEvent<EventHandler<ApplicationClosingEventArgs>,
    ApplicationClosingEventArgs>
Value
EventHandler<ApplicationClosingEventArgs>
Remarks
This event is raised when the Revit application is just about to be closed.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
No document may be modified at the time of the event.
The sender object of this event is UIControlledApplication object.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace